app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Up"], ["rating", "G"], ["release_date", "2011-05-29 00:00:00.000000"], ["created_at", "2016-07-14 18:54:28.065908"], ["updated_at", "2016-07-14 18:54:28.065908"]]
---
  def create
    @movie = Movie.create!(params[:movie])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "movies" SET "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["release_date", "2009-05-29 00:00:00.000000"], ["updated_at", "2016-07-14 19:36:00.121294"], ["id", 21]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Spielberg"]]
---
  def similar_movies
    @movie = Movie.find(params[:id])
    director_name = @movie.director
    if director_name.nil? || director_name.empty?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(director: director_name)